package com.edc.erp.common.enumeration;

/**
 * 单据前缀枚举
 * @author lee
 */
public enum OrderNoPreEnum {

    /**
     * 商品状态调整
     */
    ZT("KZT", "商品状态调整"),

    /**
     * 商品属性调整
     */
    ST("KST", "商品属性调整"),

    /**
     * 商品经营方案调整
     */
    JT("KJT", "商品经营方案调整"),

    /**
     * 商品配送方案调整
     */
    PA("KPA", "商品配送方案调整"),

    /**
     * 商品配送价格调整
     */
    PJ("KPJ", "商品配送价格调整"),

    /**
     * 商品配销价格调整
     */
    XJ("KXJ","商品配销价格调整"),

    /**
     * 配送特价
     */
    TJ("KTJ", "配送特价"),

    /**
     * 配送赠品
     */
    ZP("KZP", "配送赠品"),

    /**
     * 上下限调整单
     */
    SX("KSX", "上下限调整单"),

    /**
     *
     */
    BH("KBH", "补货单"),
    /**
     * 物流商
     */
    W("W", "物流商"),

    /**
     * 业务原因代码
     */
    R("R", "业务原因代码"),

    /**
     * 配销退货
     */
    XT("KXT", "配销退货"),

    /**
     * 配销退货通知
     */
    XZ("KXZ","配销退货通知"),
    /**
     * 直营退货
     */
    PT("KPT", "直营退货"),

    /**
     * 直营退货通知
     */
    TT("KTT","直营退货通知"),

    /**
     * 库存调整
     */
    K("K", "库存调整"),

    /**
     * 报损
     */
    B("B", "报损"),

    /**
     * 调拨
     */
    D("D", "调拨"),

    /**
     * 移库
     */
    Y("Y", "移库"),

    /**
     * 领用
     */
    L("L", "领用"),

    /**
     * 加工
     */
    J("J", "加工"),

    /**
     * 批发商
     */
    PF("PF", "批发商"),

    /**
     * 加盟商
     */
    JM("JM", "加盟商"),

    /**
     * 售价
     */
    XJZ("XJZ", "售价"),

    /**
     * 配销铺货单
     */
    XP("KXP", "配销铺货单"),
    /**
     * 配销铺货单
     */
    XPY("KXPY", "配销铺货单流水单号"),

    /**
     * 直营铺货单
     */
    SP("KSP", "直营铺货单"),
    /**
     * 配销单
     */
    PX("KPX", "配销单"),

    /**
     *
     * 直营门店要货单
     */
    MY("KMY","门店要货单"),

    /**
     * 配销集货单
     *
     */
    KJH("KJH","配销集货单"),

    /**
     * 直营订货单
     *
     */
    MB("KMB","直营订货单"),

    /**
     * 配销订货单
     *
     */
    KDH("KDH","配销订货单"),

    /**
     * 配货单
     */
    PH("KPH", "配货单"),

    /**
     * 配销差异单
     */
    KXC("KXC", "配销差异单"),
    /**
     * 配销差异单流水单号
     */
    KXCY("KXCY", "配销差异单流水单号"),
    /**
     * 直营配货差异单
     */
    KPC("KPC", "配货差异单"),
    /**
     * 配销分货单
     */
    KXF("KXF","配销分货单"),

    /**
     * 直营分货单
     */
    KFH("KFH","直营分货单"),

    /**
     * 批发出货单
     */
    KFC("KFC","批发出货单"),

    /**
     * 批发退货单
     */
    KFT("KFT","批发退货单"),

    /**
     * 配销退货资管流水单号
     */
    XTY("KXTY", "配销退货流水单号"),

    /**
     * 配销单流水单号
     */
    PXY("KPXY", "配销单流水单号"),

    /**
     * 配销订货单流水单号
     *
     */
    KDHY("KDHY","配销订货单流水单号"),

    /**
     * 批发出货单-清算流水单号前缀
     */
    KFCQ("KFCQ","清算流水单号前缀"),

    /**
     * 批发退货单流水单号
     */
    KFTQ("KFTQ","批发退货单流水单号"),

    /**
     * 配销单支付
     */
    PXPAY("KPXP", "配销单支付"),

    KYS("KYS", "预售活动单号"),

    KYD("KYD", "预售订单单号"),
    ;


    private String code;
    private String name;

    public String getCode() {
        return code;
    }

    public String getName() {
        return name;
    }

    OrderNoPreEnum(String code, String name) {
        this.code = code;
        this.name = name;
    }
}
